In [19]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### What you need to learn
- loading data
- selection
    - cols
    - rows
- manipulation
    - add column
    - remove coloumn
    - rename columns
    - change data type
    - delete data
    - remove duplicates
    - sort
    - group
    - pivot
    - merge
- Visualisation
    - line plot
    - bar plot
    - histogram
    - box plot
    - scatter plot
    - pie chart
    - heatmap
    - word cloud

In [20]:
penguins = sns.load_dataset('penguins')
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

- analysis
    - univariate analysis
    - bi- variate analysis
    - multi- variate analysis

- Loading Data
    - custom data in a variable
    - excel data
    - csv / json /etc
    - database(sql)

In [21]:
students = {
    'name' : ['Vaibhav','Siya','Aman','Amjad','Sneha','Aditi','Bhupendra'],
    'College':['SRMCEM','SRMCEM','KMC','KMC','CU','SRMCEM','SRMCEM'],
    'DOB': ['25 Jan','2 Feb','2 Apr','16 Aug','16 Sep','17 Dec','22 May']
}
sdf = pd.DataFrame(students)
sdf

        name College     DOB
0    Vaibhav  SRMCEM  25 Jan
1       Siya  SRMCEM   2 Feb
2       Aman     KMC   2 Apr
3      Amjad     KMC  16 Aug
4      Sneha      CU  16 Sep
5      Aditi  SRMCEM  17 Dec
6  Bhupendra  SRMCEM  22 May

In [26]:
data = pd.read_excel('C:/Users/Hp/Downloads/Newdata.xlsx')
data

   Unnamed: 0   Items  qty  amt
0           0  Apple   100  100
1           1  Banana   50   50
2           2  Cherry  100  200

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  3 non-null      int64
 1   Items       3 non-null      object
 2   qty         3 non-null      int64
 3   amt         3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [28]:
data.columns.tolist()

['Unnamed: 0', 'Items', 'qty', 'amt']

In [32]:
data['Items'] # Colmun selection

0    Apple
1    Banana
2    Cherry
Name: Items, dtype: object

In [33]:
data.amt

0    100
1     50
2    200
Name: amt, dtype: int64

In [34]:
data[['Items','amt']]

    Items  amt
0  Apple   100
1  Banana   50
2  Cherry  200

In [35]:
data['amt']*data['qty']

0    10000
1     2500
2    20000
dtype: int64

- Adding Columns

In [37]:
data['total']=data['amt']*data['qty']
data

   Unnamed: 0   Items  qty  amt  total
0           0  Apple   100  100  10000
1           1  Banana   50   50   2500
2           2  Cherry  100  200  20000

In [41]:
data['crap']='some crap'
data

   Unnamed: 0   Items  qty  amt  total       crap
0           0  Apple   100  100  10000  some crap
1           1  Banana   50   50   2500  some crap
2           2  Cherry  100  200  20000  some crap

- Removing Comuns

In [42]:
data.drop(columns=['crap'],inplace=True) #inplace = True to make changes permanent in the dataframe
data

   Unnamed: 0   Items  qty  amt  total
0           0  Apple   100  100  10000
1           1  Banana   50   50   2500
2           2  Cherry  100  200  20000

In [43]:
data.iloc[0]

Unnamed: 0         0
Items         Apple
qty              100
amt              100
total          10000
Name: 0, dtype: object

In [44]:
data.iloc[:2] #first two rows

   Unnamed: 0   Items  qty  amt  total
0           0  Apple   100  100  10000
1           1  Banana   50   50   2500

In [45]:
data.drop(index=[0,2])

   Unnamed: 0   Items  qty  amt  total
1           1  Banana   50   50   2500

In [46]:
data

   Unnamed: 0   Items  qty  amt  total
0           0  Apple   100  100  10000
1           1  Banana   50   50   2500
2           2  Cherry  100  200  20000

In [47]:
sdf

        name College     DOB
0    Vaibhav  SRMCEM  25 Jan
1       Siya  SRMCEM   2 Feb
2       Aman     KMC   2 Apr
3      Amjad     KMC  16 Aug
4      Sneha      CU  16 Sep
5      Aditi  SRMCEM  17 Dec
6  Bhupendra  SRMCEM  22 May

In [53]:
sdf.drop(index=[5,6],inplace=True)
sdf

      name College     DOB
0  Vaibhav  SRMCEM  25 Jan
1     Siya  SRMCEM   2 Feb
2     Aman     KMC   2 Apr
3    Amjad     KMC  16 Aug
4    Sneha      CU  16 Sep

In [54]:
data['qty']-10

0    90
1    40
2    90
Name: qty, dtype: int64

In [56]:
data['qty']=data['qty']-10
data

   Unnamed: 0   Items  qty  amt  total
0           0  Apple    90  100  10000
1           1  Banana   40   50   2500
2           2  Cherry   90  200  20000

In [57]:
data.columns.tolist()

['Unnamed: 0', 'Items', 'qty', 'amt', 'total']

In [58]:
data.rename(
    mapper={'Items':'Product',
            'qty':'Quantity',
            'amt':'Price',
            'total':'Expenditure'},
    axis=1,
    inplace=True
)
data

   Unnamed: 0 Product  Quantity  Price  Expenditure
0           0  Apple         90    100        10000
1           1  Banana        40     50         2500
2           2  Cherry        90    200        20000